app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc).paginate(page: params[:page], per_page: 4)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new post_params

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)

  def update
    if @post.update post_params
---
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?