app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order("created_at desc").paginate(page: params[:page], per_page: 4)
---
SELECT  "projects".* FROM "projects" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"

  def create
    @project = Project.new project_params

    if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sadsadsa"], ["description", "sadksamdsakld"], ["link", "`sakdaslkdsaj"], ["created_at", 2017-02-10 04:25:12 UTC], ["updated_at", 2017-02-10 04:25:12 UTC], ["slug", "sadsadsa"]]